Revit 2027 API
GenericZone.AddSpaces Method
 Adds spaces to the zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSpaces(
	ISet<ElementId> spaceIds
)
Public Sub AddSpaces (
	spaceIds As ISet(Of ElementId)
)
public:
void AddSpaces(
	ISet<ElementId^>^ spaceIds
)
member AddSpaces :
        spaceIds : ISet<ElementId> -> unit
Parameters
spaceIds ISet<ElementId>
 The spaces to be added to the zone. The spaces that are already in the zone will be ignored.
Exceptions
Exception | Condition
ArgumentException |  The ElementIdSet spaceIds must be all MEP Spaces, and associated with the same level as the zone element.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This generic zone must be space-based.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace